src/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ПеремещениеТоваров/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(СкладОтправитель) Тогда
		СкладОтправитель = Константы.ОсновнойСклад.Получить();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ЗначениеЗаполнено(СкладОтправитель) И СкладОтправитель = СкладПолучатель Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Склад-получатель должен отличаться от склада-отправителя'"),
			Ссылка, "СкладПолучатель", "Объект", Отказ);
	КонецЕсли;

	Услуги = Справочники.Номенклатура.Услуги(Товары.ВыгрузитьКолонку("Номенклатура"));
	Для Каждого СтрокаТоваров Из Товары Цикл
		Если Услуги.Найти(СтрокаТоваров.Номенклатура) <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Строка %1: «%2» - услуга, ее нельзя переместить'"),
					СтрокаТоваров.НомерСтроки, СтрокаТоваров.Номенклатура),
				Ссылка,
				ОбщегоНазначенияКлиентСервер.ПутьКРеквизитуСтроки("Товары", СтрокаТоваров.НомерСтроки, "Номенклатура"),
				"Объект", Отказ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСервер.ПодготовитьНаборыЗаписей(ЭтотОбъект);

	Данные = Документы.ПеремещениеТоваров.ДанныеДляПроведения(Ссылка);

	// Контролируем обе стороны: у отправителя товар убывает сейчас, у получателя - если при
	// перепроведении количество уменьшили или сменили склад, а товар оттуда уже ушел дальше.
	КлючиКонтроля = ПроведениеСервер.ОбъединитьКлючи(Данные.Товары, Данные.ТоварыПолучателя);
	КлючиКонтроля = ПроведениеСервер.ОбъединитьКлючи(КлючиКонтроля,
		ПроведениеСервер.КлючиДвиженийТоваровВБазе(Ссылка));
	ПроведениеСервер.ЗаблокироватьСкладскиеОстатки(КлючиКонтроля);

	ПроведениеСервер.ОчиститьДвиженияВБазе(ЭтотОбъект);

	СписаниеПартий = ПартионныйУчетСервер.РассчитатьСписаниеFIFO(Данные.Товары, МоментВремени());
	Если СписаниеПартий.Нехватка.Количество() > 0 Тогда
		ПартионныйУчетСервер.СообщитьОНехваткеПартий(СписаниеПартий.Нехватка, Ссылка, Отказ);
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаТоваров Из Данные.Товары Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = СтрокаТоваров.Номенклатура;
		Движение.Склад = СкладОтправитель;
		Движение.Количество = СтрокаТоваров.Количество;

		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = СтрокаТоваров.Номенклатура;
		Движение.Склад = СкладПолучатель;
		Движение.Количество = СтрокаТоваров.Количество;
	КонецЦикла;

	// Партия переезжает на другой склад вместе со своей себестоимостью.
	Для Каждого СтрокаСписания Из СписаниеПартий.Списание Цикл
		Движение = Движения.ПартииТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = СтрокаСписания.Номенклатура;
		Движение.Склад = СкладОтправитель;
		Движение.Партия = СтрокаСписания.Партия;
		Движение.Количество = СтрокаСписания.Количество;
		Движение.Стоимость = СтрокаСписания.Стоимость;

		Движение = Движения.ПартииТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = СтрокаСписания.Номенклатура;
		Движение.Склад = СкладПолучатель;
		Движение.Партия = СтрокаСписания.Партия;
		Движение.Количество = СтрокаСписания.Количество;
		Движение.Стоимость = СтрокаСписания.Стоимость;
	КонецЦикла;

	ПроведениеСервер.ЗаписатьДвижения(Движения.ТоварыНаСкладах);
	ПроведениеСервер.ЗаписатьДвижения(Движения.ПартииТоваров);

	ПроведениеСервер.ПроверитьСвободныеОстатки(КлючиКонтроля, Ссылка, Отказ);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	// Отмена перемещения забирает товар со склада-получателя - проверяем, что он там еще есть.
	КлючиКонтроля = ПроведениеСервер.КлючиДвиженийТоваровВБазе(Ссылка);
	ПроведениеСервер.ЗаблокироватьСкладскиеОстатки(КлючиКонтроля);
	ПроведениеСервер.УдалитьДвижения(ЭтотОбъект);

	ПроведениеСервер.ПроверитьСвободныеОстатки(КлючиКонтроля, Ссылка, Отказ);

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
